src/integration/resources/data/MCCI_IN010000UK13FailureSanitized

{"ebXML": "<?xml version='1.0' encoding='UTF-8'?>\n<soap:Envelope xmlns:xsi=\"http://www.w3c.org/2001/XML-Schema-Instance\" xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:eb=\"http://www.oasis-open.org/committees/ebxml-msg/schema/msg-header-2_0.xsd\" xmlns:xlink=\"http://www.w3.org/1999/xlink\"><soap:Header><eb:MessageHeader eb:version=\"2.0\" soap:mustUnderstand=\"1\"><eb:From><eb:PartyId eb:type=\"urn:nhs:names:partyType:ocs+serviceInstance\">YES-0000806</eb:PartyId></eb:From><eb:To><eb:PartyId eb:type=\"urn:nhs:names:partyType:ocs+serviceInstance\">B86041-822710</eb:PartyId></eb:To><eb:CPAId>1206acb80a60982448e8</eb:CPAId><eb:ConversationId>13962cb7-6d46-4986-bdb4-3201bb25f1f7</eb:ConversationId><eb:Service>urn:nhs:names:services:pds</eb:Service><eb:Action>MCCI_IN010000UK13</eb:Action><eb:MessageData><eb:MessageId>88050774-EE90-4E9B-BDB9-2A0CE36E3D3F</eb:MessageId><eb:Timestamp>2021-12-24T11:22:52Z</eb:Timestamp><eb:RefToMessageId>0A48FAFB-8FCF-4B54-9B1E-377D4D8F2565</eb:RefToMessageId></eb:MessageData><eb:DuplicateElimination/></eb:MessageHeader><eb:AckRequested eb:version=\"2.0\" soap:mustUnderstand=\"1\" soap:actor=\"urn:oasis:names:tc:ebxml-msg:actor:toPartyMSH\" eb:signed=\"false\"/><eb:SyncReply eb:version=\"2.0\" soap:mustUnderstand=\"1\" soap:actor=\"http://schemas.xmlsoap.org/soap/actor/next\"/></soap:Header><soap:Body><eb:Manifest xmlns:hl7ebxml=\"urn:hl7-org:transport/ebXML/DSTUv1.0\" eb:version=\"2.0\"><eb:Reference xlink:href=\"cid:88050774-EE90-4E9B-BDB9-2A0CE36E3D3F@spine.nhs.uk\"><eb:Schema eb:location=\"urn:hl7-org:v3_MCCI_IN010000UK13.xsd\" eb:version=\"13\"/><eb:Description xml:lang=\"en\">The HL7 payload</eb:Description><hl7ebxml:Payload style=\"HL7\" encoding=\"XML\" version=\"3.0\"/></eb:Reference></eb:Manifest></soap:Body></soap:Envelope>\r\n", "payload": "<?xml version='1.0' encoding='UTF-8'?>\n<hl7:MCCI_IN010000UK13 xmlns:hl7=\"urn:hl7-org:v3\"><hl7:id root=\"88050774-EE90-4E9B-BDB9-2A0CE36E3D3F\"/><hl7:creationTime value=\"20211224112252\"/><hl7:versionCode code=\"3NPfIT6.3.01\"/><hl7:interactionId root=\"2.16.840.1.113883.2.1.3.2.4.12\" extension=\"MCCI_IN010000UK13\"/><hl7:processingCode code=\"P\"/><hl7:processingModeCode code=\"T\"/><hl7:acceptAckCode code=\"NE\"/><hl7:acknowledgement typeCode=\"AE\"><hl7:messageRef><hl7:id root=\"13962cb7-6d46-4986-bdb4-3201bb25f1f7\"/></hl7:messageRef></hl7:acknowledgement><hl7:communicationFunctionRcv typeCode=\"RCV\"><hl7:device classCode=\"DEV\" determinerCode=\"INSTANCE\"><hl7:id root=\"1.2.826.0.1285.0.2.0.107\" extension=\"200000001694\"/></hl7:device></hl7:communicationFunctionRcv><hl7:communicationFunctionSnd typeCode=\"SND\"><hl7:device classCode=\"DEV\" determinerCode=\"INSTANCE\"><hl7:id root=\"1.2.826.0.1285.0.2.0.107\" extension=\"928942012545\"/></hl7:device></hl7:communicationFunctionSnd><hl7:ControlActEvent classCode=\"CACT\" moodCode=\"EVN\"><hl7:author1 typeCode=\"AUT\"><hl7:AgentSystemSDS classCode=\"AGNT\"><hl7:agentSystemSDS classCode=\"DEV\" determinerCode=\"INSTANCE\"><hl7:id root=\"1.2.826.0.1285.0.2.0.107\" extension=\"928942012545\"/></hl7:agentSystemSDS></hl7:AgentSystemSDS></hl7:author1><hl7:reason typeCode=\"RSON\"><hl7:justifyingDetectedIssueEvent classCode=\"ALRT\" moodCode=\"EVN\"><hl7:code code=\"15\" codeSystem=\"2.16.840.1.113883.2.1.3.2.4.17.42\" displayName=\"Update Failed\"><hl7:qualifier code=\"ER\"/></hl7:code></hl7:justifyingDetectedIssueEvent></hl7:reason><hl7:reason typeCode=\"RSON\"><hl7:justifyingDetectedIssueEvent classCode=\"ALRT\" moodCode=\"EVN\"><hl7:code code=\"IU058\" codeSystem=\"2.16.840.1.113883.2.1.3.2.4.17.42\" displayName=\"Update Failed - invalid GP Registration data supplied\"><hl7:qualifier code=\"ER\"/></hl7:code></hl7:justifyingDetectedIssueEvent></hl7:reason></hl7:ControlActEvent></hl7:MCCI_IN010000UK13>", "attachments": []}
